
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Akihiro1001/aws-ecs-terraform/actions/runs/5035626456)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_task_assume: Reading...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-056fe42137121ab23]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f0dd577b6a580cb7]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0320ac62caeaa7389]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0239dae77dd06e08b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-053e7113956f941a5]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0863081fb8ee5dc4b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05f8d8de411c15369]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03f34da35d1513cc6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0777319f9135b1951]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d213fca1fe5e63ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b7620782af7fcfdc]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0055e2096efcdf432]
aws_security_group.ecs: Refreshing state... [id=sg-0d9c9b456395c778a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04b35dbc37682e7c6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ee05e5fe37c19eb6]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:targetgroup/go-simple-server-target-group/26c097ce080cf4b2]
aws_security_group.alb: Refreshing state... [id=sg-0d1fb1e79c58dc2bc]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0777319f9135b19511080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-077b629d7119a77e3]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01915e3b3d0684c2c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03ab0044aef7d9e99]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fcd1681f1faef93a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01404b9acf6c213fc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-079b4d08769220b42]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3601755104]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:loadbalancer/app/go-simple-server-alb/65017f648e3d1160]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ee05e5fe37c19eb61080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener-rule/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687/704b43ac89b14866]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "go-simple-server"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:targetgroup/go-simple-server-target-group/26c097ce080cf4b2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d9c9b456395c778a",
            ]
          + subnets          = [
              + "subnet-0239dae77dd06e08b",
              + "subnet-0b7620782af7fcfdc",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230521033424434300000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:115748871192:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:115748871192:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"9be8ef785f783c133627b6c6b05c40867a59cffd","Vars":{},"WorkflowName":"Terraform"} -->